1. 二叉查找树（英语：Binary Search Tree）
   (1) 基本概念
   它的其它名称也叫BST，排序二叉树、有序二叉树、二叉搜索树.
   是一种排序好的树结构，具体定义为:
   a> 如果任意节点的左子树不为空，则左子树上的所有数据均小于根节点上的树；
   b> 如果任意节点的右子树不为空，则右子树上的所有数据均大于根节点上的树；
   c> 任意左、右子数也为二叉查找数；
   d> 没有键值相等的节点。
   
   二叉树的优势是查找、插入效率较高，其对应的时间复杂度为O(log2n)，最坏的情况(数据有序时)为O(n)。
   
   （2）算法
   a> 查找
      若b是空树，则搜索失败，否则：
      若查找对象x的值等于根上的值，查找成功，否则：
      若查找对象x的值小于根上的值，则搜索左子树，否则：
      查找右子树。
      
   b> 插入
      若树为空，则插入值x为根节点，否则：
      若插入的值x等于根节点，则返回，否则：
      如插入的值x小于根节点，则插入到左子树，否则
      插入到右子树中。
      
   c> 删除
      若删除的值x为叶子节点，则直接删除，并将父节点指向的它的指针删除（不破坏树的结构）；
      若删除的值x只有左子树或右子树，则将值的对应的父节点指针指向x值的左子树或者右子树（不破坏树的结构）；
      若删除的值x左右子树都存在，则将x值的父指针指向x的左子树，同时找到x左子树中最后一个右叶子节点，并将x的右子树指向此叶子节点。
2. 

